OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1010/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.047628690549573 0 -7.111497510383707)
	(16.571443035824355 0 -7.111497510383707)
	(16.571443035824355 8.103799488576781 -7.111497510383707)
	(-11.047628690549573 8.103799488576781 -7.111497510383707)
	(-11.047628690549573 0 2.8115222715470467)
	(16.571443035824355 0 2.8115222715470467)
	(16.571443035824355 8.103799488576781 2.8115222715470467)
	(-11.047628690549573 8.103799488576781 2.8115222715470467)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (167 49 60) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

