OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1010/0.org/include/initialConditions
flowVelocity          (0.743045 0 0);
Umean                  0.743045;
turbulentKE            8.281743e-05;
turbulentOmega         6.733898e-01;
turbulentEpsilon       1.804928e-04;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;